app/views/alunos/_form.html.erb

SELECT "cursos".* FROM "cursos" ORDER BY "cursos"."nome" ASC
---
    <div class="col-xs-4">
      <%= f.collection_select :curso_id, Curso.order(:nome), :id, :nome, {prompt: "Selecione um curso"}, {class: "form-control"} %>