app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

INSERT INTO "alunos" ("created_at", "curso_id_id", "login", "nome", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 May 2014 22:41:56 UTC +00:00], ["curso_id_id", 1], ["login", "201110487"], ["nome", "Rita"], ["senha", "hehe"], ["updated_at", Sat, 03 May 2014 22:41:56 UTC +00:00]]
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

UPDATE "alunos" SET "curso_id" = ?, "updated_at" = ? WHERE "alunos"."id" = 1  [["curso_id", 3], ["updated_at", Sat, 03 May 2014 23:08:27 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @aluno.update(aluno_params)

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])