app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

INSERT INTO "cursos" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 03 May 2014 20:16:57 UTC +00:00], ["nome", "Tesrw"], ["updated_at", Sat, 03 May 2014 20:16:57 UTC +00:00]]
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

UPDATE "cursos" SET "nome" = ?, "updated_at" = ? WHERE "cursos"."id" = 1  [["nome", "Sistemas De Informação"], ["updated_at", Sat, 03 May 2014 20:51:43 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @curso.update(curso_params)

DELETE FROM "cursos" WHERE "cursos"."id" = ?  [["id", 2]]
---
  def destroy
    @curso.destroy

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_curso
      @curso = Curso.find(params[:id])